# Bank Financial Data Simple ETL

> For this project, I assumed the role of data engineer working for an international financial company. For this project, I extracted financial data from a websites & a API. After you collect the data, you extract the data of interest to your company and transform it based on the requirements given to you. Once the transformation is complete you load that data into a database.


- Collect data using APIs
- Collect data using webscraping.  
- Perform transformations.
- Load data to csv files.

In [2]:
import pandas as pd
import html5lib
import requests
import time
from datetime import datetime
from bs4 import BeautifulSoup

# Extract Data from API

#### https://exchangeratesapi.io/

In [3]:
api_url = 'https://api.apilayer.com/exchangerates_data/latest?base=EUR&apikey=DS9yDpqy7PQxaJkjrhGqq7lrmMFg7Tm0'

In [4]:
api_response = requests.get(api_url)
print(api_response.status_code)

200

In [40]:
api_data = api_response.json()
api_data

{'success': True,
 'timestamp': 1682963103,
 'base': 'EUR',
 'date': '2023-05-01',
 'rates': {'AED': 4.027439,
  'AFN': 94.48898,
  'ALL': 110.758952,
  'AMD': 425.597376,
  'ANG': 1.972635,
  'AOA': 558.789637,
  'ARS': 243.852081,
  'AUD': 1.653686,
  'AWG': 1.974119,
  'AZN': 1.862869,
  'BAM': 1.948919,
  'BBD': 2.210017,
  'BDT': 116.189778,
  'BGN': 1.947041,
  'BHD': 0.413518,
  'BIF': 2279.613901,
  'BMD': 1.096733,
  'BND': 1.463473,
  'BOB': 7.563228,
  'BRL': 5.472044,
  'BSD': 1.094526,
  'BTC': 3.8762588e-05,
  'BTN': 89.53932,
  'BWP': 14.496817,
  'BYN': 2.762746,
  'BYR': 21495.963869,
  'BZD': 2.206231,
  'CAD': 1.484565,
  'CDF': 2297.655219,
  'CHF': 0.982452,
  'CLF': 0.032071,
  'CLP': 884.932161,
  'CNY': 7.580725,
  'COP': 5163.692443,
  'CRC': 590.43156,
  'CUC': 1.096733,
  'CUP': 29.063421,
  'CVE': 110.715359,
  'CZK': 23.604817,
  'DJF': 194.911373,
  'DKK': 7.453496,
  'DOP': 59.850328,
  'DZD': 148.782774,
  'EGP': 34.057467,
  'ERN': 16.450993,
  'ETB': 59.287338,
  'EUR': 1,
  'FJD': 2.437215,
  'FKP': 0.872411,
  'GBP': 0.878077,
  'GEL': 2.730623,
  'GGP': 0.872411,
  'GHS': 12.915283,
  'GIP': 0.872411,
  'GMD': 65.749092,
  'GNF': 9410.034125,
  'GTQ': 8.542838,
  'GYD': 231.490583,
  'HKD': 8.609517,
  'HNL': 26.909746,
  'HRK': 7.475477,
  'HTG': 168.559491,
  'HUF': 372.307605,
  'IDR': 16091.867585,
  'ILS': 3.971983,
  'IMP': 0.872411,
  'INR': 89.696461,
  'IQD': 1433.837661,
  'IRR': 46336.96265,
  'ISK': 149.693299,
  'JEP': 0.872411,
  'JMD': 167.606716,
  'JOD': 0.778019,
  'JPY': 150.73771,
  'KES': 149.155609,
  'KGS': 95.986153,
  'KHR': 4504.138656,
  'KMF': 489.937942,
  'KPW': 987.059279,
  'KRW': 1471.541431,
  'KWD': 0.336146,
  'KYD': 0.912179,
  'KZT': 494.573847,
  'LAK': 18905.252692,
  'LBP': 16428.995421,
  'LKR': 350.711769,
  'LRD': 181.235162,
  'LSL': 20.071459,
  'LTL': 3.238367,
  'LVL': 0.663403,
  'LYD': 5.21364,
  'MAD': 10.984518,
  'MDL': 19.663575,
  'MGA': 4812.010608,
  'MKD': 61.398226,
  'MMK': 2298.464034,
  'MNT': 3818.557377,
  'MOP': 8.850153,
  'MRO': 391.533439,
  'MUR': 49.298263,
  'MVR': 16.846092,
  'MWK': 1123.43358,
  'MXN': 19.675157,
  'MYR': 4.891976,
  'MZN': 69.368448,
  'NAD': 20.066501,
  'NGN': 504.90284,
  'NIO': 40.029765,
  'NOK': 11.78162,
  'NPR': 143.263111,
  'NZD': 1.778544,
  'OMR': 0.422871,
  'PAB': 1.094536,
  'PEN': 4.075671,
  'PGK': 3.858483,
  'PHP': 60.914187,
  'PKR': 310.519772,
  'PLN': 4.606114,
  'PYG': 7931.0707,
  'QAR': 3.993177,
  'RON': 4.925868,
  'RSD': 116.730771,
  'RUB': 87.025868,
  'RWF': 1229.946309,
  'SAR': 4.113408,
  'SBD': 9.141275,
  'SCR': 15.321042,
  'SDG': 657.491627,
  'SEK': 11.332031,
  'SGD': 1.465602,
  'SHP': 1.33445,
  'SLE': 24.391346,
  'SLL': 21660.473859,
  'SOS': 623.49359,
  'SRD': 40.912131,
  'STD': 22700.15571,
  'SVC': 9.577187,
  'SYP': 2755.5757,
  'SZL': 20.144876,
  'THB': 37.578423,
  'TJS': 11.958108,
  'TMT': 3.838565,
  'TND': 3.323345,
  'TOP': 2.591361,
  'TRY': 21.337593,
  'TTD': 7.43774,
  'TWD': 33.784309,
  'TZS': 2577.322153,
  'UAH': 40.409529,
  'UGX': 4088.527674,
  'USD': 1.096733,
  'UYU': 42.390721,
  'UZS': 12466.983788,
  'VEF': 2707869.346861,
  'VES': 27.091015,
  'VND': 25734.836336,
  'VUV': 129.961403,
  'WST': 2.945828,
  'XAF': 653.686121,
  'XAG': 0.043973,
  'XAU': 0.000554,
  'XCD': 2.963976,
  'XDR': 0.81014,
  'XOF': 653.686121,
  'XPF': 119.050385,
  'YER': 274.566888,
  'ZAR': 20.155103,
  'ZMK': 9871.9156,
  'ZMW': 19.455487,
  'ZWL': 353.14753}}

In [49]:
test_api = pd.json_normalize(api_data['rates'].values())
test_api['shalonn'] = api_data['rates'].keys()
test_api

    shalonn
0       AED
1       AFN
2       ALL
3       AMD
4       ANG
..      ...
165     YER
166     ZAR
167     ZMK
168     ZMW
169     ZWL

[170 rows x 1 columns]

In [52]:
test_api = pd.DataFrame(test_api)
test_api.head()

  shalonn
0     AED
1     AFN
2     ALL
3     AMD
4     ANG

### Transformation 

> One column was imported as a nested dictonary. There I normalized that column to seperated the key from the value. I then created it into a pandas dataframe, appended to the other dataframe with included the entire dataset.

In [41]:
df_api = pd.DataFrame(api_data)
df_api.head(10)

     success   timestamp base        date       rates
AED     True  1682963103  EUR  2023-05-01    4.027439
AFN     True  1682963103  EUR  2023-05-01   94.488980
ALL     True  1682963103  EUR  2023-05-01  110.758952
AMD     True  1682963103  EUR  2023-05-01  425.597376
ANG     True  1682963103  EUR  2023-05-01    1.972635
AOA     True  1682963103  EUR  2023-05-01  558.789637
ARS     True  1682963103  EUR  2023-05-01  243.852081
AUD     True  1682963103  EUR  2023-05-01    1.653686
AWG     True  1682963103  EUR  2023-05-01    1.974119
AZN     True  1682963103  EUR  2023-05-01    1.862869

In [ ]:
df_api

In [36]:
df_api.dtypes()

TypeError: 'Series' object is not callable

In [35]:
df_api.columns

Index(['success', 'timestamp', 'base', 'date', 'rates'], dtype='object')

# Extract from Webscraping

In [21]:
bank_url = 'https://www.relbanks.com/worlds-top-banks/assets'
bank_data_response = requests.get(bank_url)

print(bank_data_response.status_code)

200

In [22]:
bank_tables = pd.read_html(bank_url)

In [23]:
bank_df = pd.DataFrame(bank_tables[0])
bank_df.head()

,0,1,2,3,4
0,Rank,Bank,Country,"Total assets, US$b",Balance sheet
1,1,Industrial & Commercial Bank of China,China,4005.58,12/31/2017
2,2,China Construction Bank Corp,China,3397.13,12/31/2017
3,3,Agricultural Bank of China,China,3232.68,12/31/2017
4,4,Bank of China,China,2989.16,12/31/2017

In [24]:
bank_df.columns = ['Rank', 'Bank', 'Country', 'Total_Assets', 'Balance_Sheet']
bank_df

,Rank,Bank,Country,Total_Assets,Balance_Sheet
0,Rank,Bank,Country,"Total assets, US$b",Balance sheet
1,1,Industrial & Commercial Bank of China,China,4005.58,12/31/2017
2,2,China Construction Bank Corp,China,3397.13,12/31/2017
3,3,Agricultural Bank of China,China,3232.68,12/31/2017
4,4,Bank of China,China,2989.16,12/31/2017
...,...,...,...,...,...
116,116,Qatar National Bank,Qatar,221.180,12/31/2017
117,117,National Bank of Canada,Canada,208.408,12/31/2017
118,118,Suntrust Banks,USA,205.962,12/31/2017
119,119,Korea Development Bank,South Korea,205.145,12/31/2016
120,120,Belfius,Belgium,201.192,12/31/2017

In [25]:
bank_df = bank_df.iloc[1:, :]
bank_df.head()

,Rank,Bank,Country,Total_Assets,Balance_Sheet
1,1,Industrial & Commercial Bank of China,China,4005.58,12/31/2017
2,2,China Construction Bank Corp,China,3397.13,12/31/2017
3,3,Agricultural Bank of China,China,3232.68,12/31/2017
4,4,Bank of China,China,2989.16,12/31/2017
5,5,Mitsubishi UFJ Financial Group,Japan,2773.82,12/31/2017

In [26]:
bank_df

,Rank,Bank,Country,Total_Assets,Balance_Sheet
1,1,Industrial & Commercial Bank of China,China,4005.58,12/31/2017
2,2,China Construction Bank Corp,China,3397.13,12/31/2017
3,3,Agricultural Bank of China,China,3232.68,12/31/2017
4,4,Bank of China,China,2989.16,12/31/2017
5,5,Mitsubishi UFJ Financial Group,Japan,2773.82,12/31/2017
...,...,...,...,...,...
116,116,Qatar National Bank,Qatar,221.180,12/31/2017
117,117,National Bank of Canada,Canada,208.408,12/31/2017
118,118,Suntrust Banks,USA,205.962,12/31/2017
119,119,Korea Development Bank,South Korea,205.145,12/31/2016
120,120,Belfius,Belgium,201.192,12/31/2017

In [ ]:
# Converting API & Webscraping DataFrames to csv